app/views/mappings/show.html.erb


  <% @mapping.entries.where(database: [1]).find_each do |entry| %>
---
SELECT  "entries".* FROM "entries" WHERE "entries"."mapping_id" = ? AND "entries"."database" = 1  ORDER BY "entries"."id" ASC LIMIT 1000  [["mapping_id", 17]]