app/controllers/entries_controller.rb

SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "entries" ("tablename", "colname", "coltype", "database", "mapping_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tablename", "hi"], ["colname", "firstname"], ["coltype", "string"], ["database", 1], ["mapping_id", 8], ["created_at", "2015-10-09 13:50:04.186596"], ["updated_at", "2015-10-09 13:50:04.186596"]]
---
	def create
		@mapping = Mapping.find(params[:mapping_id])
		@entry = @mapping.entries.create(entry_params)

SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "entries".* FROM "entries" WHERE "entries"."mapping_id" = ? AND "entries"."id" = ? LIMIT 1  [["mapping_id", 17], ["id", 2]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 2]]
---
	def destroy
		@mapping = Mapping.find(params[:mapping_id])
    	@entry = @mapping.entries.find(params[:id])
    	@entry.destroy