app/controllers/mapping_controller.rb

	def index
    @mapping = Mapping.all
---
SELECT "mappings".* FROM "mappings"