app/controllers/mappings_controller.rb

  def index
    @mappings = Mapping.all
---
SELECT "mappings".* FROM "mappings"

  def edit
    @mapping = Mapping.find(params[:id])
---
SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", 8]]

  def show
    @mapping = Mapping.find(params[:id])
---
SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", 11]]

  def create
    # flash[:notice] =  'Article'
    @mapping = Mapping.new(params.require(:mapping).permit(:database, :coltype, :colname, :database2, :coltype2, :colname2))
    if @mapping.save
---
INSERT INTO "mappings" ("database1", "database2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["database1", "1"], ["database2", "2"], ["created_at", "2015-10-09 14:45:19.587554"], ["updated_at", "2015-10-09 14:45:19.587554"]]

  def update
    @mapping = Mapping.find(params[:id])
    # render plain: params[:mapping].inspect
    if @mapping.update(params.require(:mapping).permit(:database, :coltype, :colname, :database2, :coltype2, :colname2))
---
SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "mappings" SET "colname" = ?, "updated_at" = ? WHERE "mappings"."id" = ?  [["colname", "Home1"], ["updated_at", "2015-10-07 19:24:49.592909"], ["id", 8]]

  def destroy
    @mapping = Mapping.find(params[:id])
    @mapping.destroy
---
SELECT  "mappings".* FROM "mappings" WHERE "mappings"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "mappings" WHERE "mappings"."id" = ?  [["id", 1]]