app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "password_digest" = ?, "company" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$Ernz4hLdEOxvYN/8OCe3v.jz1RTsZAbf/HMy0EjGPELnKjS3f6lMG"], ["company", "University of Michigan"], ["updated_at", "2015-10-14 01:36:10.138937"], ["id", 3]]

  def edit_password
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]